phatpaul/ArduinoCore-LPC8xx/variants/lpc804/variant.h
// SPDX-License-Identifier: BSD-3-Clause
// ArduinoCore-LPC8xx — LPC804 pin map
//
// SKELETON: physical pin numbers TBD against the LPC804M101JDH24 datasheet.
#ifndef ARDUINO_CORE_LPC8XX_VARIANT_LPC804_H
#define ARDUINO_CORE_LPC8XX_VARIANT_LPC804_H

#include <stdint.h>

#define VARIANT_MCU_LPC804      1
#define VARIANT_FLASH_SIZE      (32u * 1024u)
#define VARIANT_SRAM_SIZE       (4u * 1024u)
#define VARIANT_FRO_HZ          15000000u

#define VARIANT_NUM_DIGITAL_PINS 22u

#endif // ARDUINO_CORE_LPC8XX_VARIANT_LPC804_H
